home/emacs/README.org
#+Title: My Emacs config
#+Property: header-args :tangle init.el 
#+auto_tangle: t
#+startup: overview
* Bootstrap
** Package.el
#+begin_src elisp
(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(package-initialize)
#+end_src

** Use-package
#+begin_src elisp
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-when-compile
  (require 'use-package))
(setq use-package-always-ensure t)
#+end_src

** Ability to reload configuration
#+begin_src elisp
(defun reload-init-file ()
  "Reload the `init.el` configuration file."
  (interactive)
  (load-file (expand-file-name "~/.emacs.d/init.el")))
#+end_src

* Evil
#+begin_src elisp
(use-package evil
  :init
  (setq evil-want-C-u-scroll t
	evil-want-keybinding nil) ;; Enable C-u for scrolling
  :config
  (evil-mode 1)
  (evil-set-undo-system 'undo-redo))
#+end_src

** Evil collection
#+begin_src elisp
(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))
#+end_src

** Evil commenter
#+begin_src elisp
(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))
#+end_src

* Org-mode
** Table of contents 
#+begin_src elisp
(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Bullets & Todos
#+begin_src elisp
  (use-package org-superstar
    :config
    (setq org-ellipsis "⤵"
	  org-superstar-special-todo-items t
	  org-superstar-todo-bullet-alist
	  '(("TODO" . ?☐)
	    ("DONE" . ?✔)))
    (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))
  (org-superstar-restart)
#+end_src

** Babel
*** Code blocks
#+begin_src elisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((js . t)
   (C . t)
   (java . t)
   (python . t)))
#+end_src

**** Java settings
#+begin_src elisp
  (nconc org-babel-default-header-args:java
	 '((:dir . "/tmp/")))
#+end_src

**** Syntax highlight in export
#+begin_src elisp
  (setq org-latex-listings 'minted
	org-latex-packages-alist '(("" "minted"))
	org-latex-pdf-process
	'("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
	  "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
#+end_src

*** Automatic tangle
#+begin_src elisp
  (use-package org-auto-tangle
    :hook (org-mode . org-auto-tangle-mode))
#+end_src

** Agenda 
*** Discover files
#+begin_src elisp
  (setq org-directory "~/org")
  (setq org-agenda-files '("Todos.org" "Timetable.org"))
#+end_src

*** Custom view
Credit to Derek Taylor
#+begin_src elisp
(setq
 ;; org-fancy-priorities-list '("[A]" "[B]" "[C]")
 ;; org-fancy-priorities-list '("❗" "[B]" "[C]")
 org-fancy-priorities-list '("🟥" "🟧" "🟨")
 org-priority-faces
 '((?A :foreground "#ff6c6b" :weight bold)
   (?B :foreground "#98be65" :weight bold)
   (?C :foreground "#c678dd" :weight bold))
 org-agenda-block-separator 8411)

(setq org-agenda-custom-commands
      '(("v" "A better agenda view"
         ((tags "PRIORITY=\"A\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "High-priority unfinished tasks:")))
          (tags "PRIORITY=\"B\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Medium-priority unfinished tasks:")))
          (tags "PRIORITY=\"C\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Low-priority unfinished tasks:")))
          (tags "customtag"
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Tasks marked with customtag:")))

          (agenda "")
          (alltodo "")))))
#+end_src

*** Show 12 hr clock
#+begin_src elisp
  (setq org-agenda-timegrid-use-ampm 1)
#+end_src

** Tweaks
*** Hide marks
#+begin_src elisp
  (setq org-hide-emphasis-markers t)
#+end_src
*** Follow link
#+begin_src elisp
  (setq org-return-follows-link t)
#+end_src

*** Further tweaks
#+begin_src elisp
  (setq org-startup-indented t
        org-startup-with-inline-images t
        org-image-actual-width '(300))
#+end_src

* Project management
** Tabs and spaces
#+begin_src elisp
(setq tab-width 2)
(setq-default ident-tabs-mode nil)
#+end_src

** Projectile
#+begin_src elisp
(use-package projectile
  :config
  (projectile-mode +1))
#+end_src

*** Ivy Integration
#+begin_src elisp
(use-package counsel-projectile
  :config
  (counsel-projectile-mode 1))
#+end_src

** Git
#+begin_src elisp
(use-package magit
  )
#+end_src

** File explorer
#+begin_src elisp
(use-package neotree
  :config
  (setq neo-theme (if (display-graphic-p) 'icons 'arrow)
	neo-window-width 25
	neo-smart-open t
	neo-show-hidden-files t)
  :bind
  (:map evil-normal-state-map
        ("C-n" . neotree-toggle))
  )
#+end_src

* Buffers management
** Tmux navigation
#+begin_src elisp
(use-package tmux-pane
  :config
  (tmux-pane-mode)
  )
#+end_src

** Tabs
#+begin_src elisp
  (use-package centaur-tabs
    :demand
    :config
    (centaur-tabs-mode t)
    (centaur-tabs-headline-match)
    (setq centaur-tabs-height 40
	  centaur-tabs-style "wave"
	  centaur-tabs-set-icons t
	  centaur-tabs-gray-out-icons 'buffer
	  centaur-tabs-set-bar 'under
	  x-underline-at-descent-line t
	  centaur-tabs-set-modified-marker t))
#+end_src

** Jumping in the file
#+begin_src elisp
(use-package avy)
#+end_src

* LSP stuff
** Yasnippet
#+begin_src elisp
(use-package yasnippet-snippets)

(use-package yasnippet
  :config
  (yas-global-mode 1)
  )
#+end_src

*** Ivy Integration
#+begin_src elisp
(use-package ivy-yasnippet
  :bind (("C-c y" . ivy-yasnippet)))
#+end_src

** Eglot
#+begin_src elisp
  (require 'eglot)
  (add-hook 'c++-mode-hook 'eglot-ensure)
  (add-hook 'typescript-mode-hook 'eglot-ensure)
  (add-hook 'js-mode-hook 'eglot-ensure)

  (setq lsp-prefer-flymake nil
	lsp-prefer-capf t
	gc-cons-threshold 100000000
	read-process-output-max (* 1024 1024)
	lsp-idle-delay 0.500
	lsp-log-io nil)
#+end_src

** Dap-mode
#+begin_src elisp
(use-package dap-mode
  :config
  (setq dap-auto-configure-mode t))
#+end_src

** Company-mode
#+begin_src elisp
(use-package company
  :after eglot
  :hook (prog-mode . company-mode)
  :bind
  (:map company-active-map
        ("<tab>" . company-complete-selection))
  (:map eglot-mode-map 
        ("<tab>" . company-indent-or-complete-common))
  :config
  ;; (add-to-list 'company-backends 'company-yasnippet)
  (setq company-idle-delay 0.0
	company-minimum-prefix-length 1
	company-dabbrev-downcase 0
	company-box-doc-enable nil))
#+end_src

*** Company box
#+begin_src elisp
(use-package company-box
  :hook (company-mode . company-box-mode))

(setq company-box-icons-unknown 'fa_question_circle)
(setq company-box-icons-elisp
      '((fa_tag :face font-lock-function-name-face) ;; Function
	(fa_cog :face font-lock-variable-name-face) ;; Variable
	(fa_cube :face font-lock-constant-face) ;; Feature
	(md_color_lens :face font-lock-doc-face))) ;; Face
(setq company-box-icons-yasnippet 'fa_bookmark)
(setq company-box-icons-lsp
      '((1 . fa_text_height) ;; Text
        (2 . (fa_tags :face font-lock-function-name-face)) ;; Method
        (3 . (fa_tag :face font-lock-function-name-face)) ;; Function
        (4 . (fa_tag :face font-lock-function-name-face)) ;; Constructor
        (5 . (fa_cog :foreground "#FF9800")) ;; Field
        (6 . (fa_cog :foreground "#FF9800")) ;; Variable
        (7 . (fa_cube :foreground "#7C4DFF")) ;; Class
        (8 . (fa_cube :foreground "#7C4DFF")) ;; Interface
        (9 . (fa_cube :foreground "#7C4DFF")) ;; Module
        (10 . (fa_cog :foreground "#FF9800")) ;; Property
        (11 . md_settings_system_daydream) ;; Unit
        (12 . (fa_cog :foreground "#FF9800")) ;; Value
        (13 . (md_storage :face font-lock-type-face)) ;; Enum
        (14 . (md_closed_caption :foreground "#009688")) ;; Keyword
        (15 . md_closed_caption) ;; Snippet
        (16 . (md_color_lens :face font-lock-doc-face)) ;; Color
        (17 . fa_file_text_o) ;; File
        (18 . md_refresh) ;; Reference
        (19 . fa_folder_open) ;; Folder
        (20 . (md_closed_caption :foreground "#009688")) ;; EnumMember
        (21 . (fa_square :face font-lock-constant-face)) ;; Constant
        (22 . (fa_cube :face font-lock-type-face)) ;; Struct
        (23 . fa_calendar) ;; Event
        (24 . fa_square_o) ;; Operator
        (25 . fa_arrows)) ;; TypeParameter
      )
#+end_src


** Tree-sitter
#+begin_src elisp
(require 'tree-sitter-langs)
(require 'tree-sitter)
(global-tree-sitter-mode)
(add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
#+end_src

** Minimap
Like in vscode
#+begin_src elisp
(use-package minimap
  )
#+end_src

** Formatter
#+begin_src elisp
(use-package format-all
  :config
  (add-hook 'prog-mode-hook 'format-all-mode))
#+end_src

** Indentation and parenthesis
