home/emacs/README.org
*** Indent blankline
#+begin_src elisp
;; Indent blankline
(use-package highlight-indent-guides
  :config
  (setq highlight-indent-guides-method 'character
	highlight-indent-guides-responsive 'top)
  (add-hook 'prog-mode-hook 'highlight-indent-guides-mode))
#+end_src

*** Colorization
#+begin_src elisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package rainbow-mode
  :hook (prog-mode . rainbow-mode))
#+end_src

*** Smart parentheses
#+begin_src elisp
(use-package smartparens
  :config
  (require 'smartparens-config)
  (smartparens-global-mode 1))
#+end_src

** Direnv support
#+begin_src elisp
(use-package direnv
  :config
  (direnv-mode))
#+end_src

** Programming language modes
*** Nix
#+begin_src elisp
(use-package nix-mode
  :mode "\\.nix\\'")
#+end_src

*** Typescript
#+begin_src elisp
(use-package typescript-mode
  :config
  (setq typescript-indent-level 2))
(setq js-indent-level 2)
(setq css-indent-offset 2)
#+end_src

*** Markdown
#+begin_src elisp
(use-package markdown-mode
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "pandoc")
  )
#+end_src


*** Latex
#+begin_src elisp
(use-package xenops
  :config
  (add-hook 'latex-mode-hook #'xenops-mode)
  (add-hook 'LaTeX-mode-hook #'xenops-mode)
  (add-hook 'org-mode-hook #'xenops-mode)
  )
#+end_src

* Terminal
#+begin_src elisp
(use-package vterm)

(use-package vterm-toggle
  :after vterm
  :config
  (setq vterm-toggle-fullscreen-p nil)
  (setq vterm-toggle-scope 'project)
  (add-to-list 'display-buffer-alist
               '((lambda (buffer-or-name _)
                   (let ((buffer (get-buffer buffer-or-name)))
                     (with-current-buffer buffer
                       (or (equal major-mode 'vterm-mode)
                           (string-prefix-p vterm-buffer-name (buffer-name buffer))))))
                 (display-buffer-reuse-window display-buffer-at-bottom)
                 ;;(display-buffer-reuse-window display-buffer-in-direction)
                 ;;display-buffer-in-direction/direction/dedicated is added in emacs27
                 ;;(direction . bottom)
                 (dedicated . t) ;dedicated is supported in emacs27
                 (reusable-frames . visible)
                 (window-height . 0.3))))
#+end_src

* Keybind management
** Which key
#+begin_src elisp
(use-package which-key
  :init
  (which-key-mode 1)
  :config
  (setq which-key-side-window-location 'bottom
        which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 6
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-idle-delay 0.8
        which-key-max-description-length 25
        which-key-allow-imprecise-window-fit t))
#+end_src

** General
#+begin_src elisp
  (use-package general
    :config
    (general-evil-setup)
    (general-create-definer ys/leader-keys
      :states '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC"
      :global-prefix "M-SPC")


    (ys/leader-keys
      "f" '(:ignore t :wk "projectile")
      "ff" '(projectile-find-file :wk "Find file")
      "fb" '(projectile-switch-to-buffer :wk "Switch to buffer")
      "fp" '(projectile-switch-project :wk "Switch project")
      )

    (ys/leader-keys
      "x" '(kill-this-buffer :wk "Kill buffer"))

    (ys/leader-keys
      "j" '(avy-goto-char-2 :wk "Search buffer"))

    (ys/leader-keys
      "s" '(:ignore t :wk "window")
      "sh" '(evil-window-split :wk "Horizontal split")
      "sv" '(evil-window-vsplit :wk "Vertical split"))


    (ys/leader-keys
      "t" '(vterm-toggle :wk "vterm")
      )

    (ys/leader-keys
      "c" '(centaur-tabs-ace-jump :wk "Jump to tab")
      )

    (ys/leader-keys
      "l" '(:ignore t :wk "Lsp")
      "lr" '(eglot-rename :wk "Rename reference")
      "lf" '(format-all-buffer
	     :wk "Formats buffer"))

    (ys/leader-keys
      "o" '(:ignore t :wk "Org")
      "oa" '(org-agenda :wk "Org agenda")
      "oe" '(org-export-dispatch :wk "Org export")
      "oi" '(org-toggle-item :wk "Org toggle Item")
      "ot" '(org-todo :wk "Org Todo")
      "oT" '(org-todo-list :wk "Org Todo List")
      )

    (ys/leader-keys
      "g" '(magit :wk "Open magit"))
    )
#+end_src

* UI
** Icons and status bar
#+begin_src elisp
(use-package all-the-icons
  :if (display-graphic-p))

(use-package doom-modeline
  :init (doom-modeline-mode 1))
#+end_src

** Dashboard
#+begin_src elisp
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))
(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
(setq dashboard-banner-logo-title "Welcome to Emacs")
(setq dashboard-startup-banner 'official)
(setq dashboard-center-content t)
(setq dashboard-set-file-icons t)
(setq dashboard-set-heading-icons t)

;; Sets which dashboard items should show
(setq dashboard-items '((recents  . 5)
                        (bookmarks . 5)
                        (projects . 5)
                        (agenda . 5)))
#+end_src

** Dracula theme
#+begin_src elisp
;; Uses dracula theme
(use-package dracula-theme)
(load-theme 'dracula t)
#+end_src

** Font & relative line numbering
#+begin_src elisp
(add-to-list 'default-frame-alist '(font . "JetBrainsMono NF-15"))
(setq display-line-numbers 'relative 
      display-line-numbers-current-absolute t)
#+end_src

** Ligatures
#+begin_src elisp
(use-package ligature
  :config
  ;; Enable the "www" ligature in every possible major mode
  (ligature-set-ligatures 't '("www"))
  ;; Enable traditional ligature support in eww-mode, if the
  ;; `variable-pitch' face supports it
  (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
  ;; Enable all Cascadia Code ligatures in programming modes
  (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                       ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                       "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                       "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                       "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                       "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                       "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                       "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                       ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                       "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                       "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                       "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                       "\\\\" "://"))
  ;; Enables ligature checks globally in all buffers. You can also do it
  ;; per mode with `ligature-mode'.
  (global-ligature-mode t))
#+end_src

** Cursor highlight
#+begin_src elisp
(use-package beacon
  :config
  (setq beacon-blink-when-window-scrolls t)
  (beacon-mode 1))


#+end_src

** Disable built in UI
#+begin_src elisp
(scroll-bar-mode -1)
#+end_src

* Grammar
** Language tool
Credit to doom-emacs devs
#+begin_src elisp
  (use-package langtool
    :commands (langtool-check
	       langtool-check-done
	       langtool-show-message-at-point
	       langtool-correct-buffer)
    :init (setq langtool-default-language "en-US")
    :config
    (unless (or langtool-bin
		langtool-language-tool-jar
		langtool-java-classpath)
      (cond ((setq langtool-bin
		   (or (executable-find "languagetool-commandline")
		       (executable-find "languagetool")))))))  ; for nixpkgs.languagetool
#+end_src

* Useful extra settings
** Automatic revert of buffers
#+begin_src elisp
;; Automatically reverts buffers for changed files
(global-auto-revert-mode 1)

;; Reverts dired as well
(setq global-auto-revert-non-file-buffers t)

;; Remembers the last place you visited in a file
(save-place-mode 1)
#+end_src

