home/emacs/README.org
** Disables annoying features
#+begin_src elisp
;; Disable unrelated warnings
(setq warning-minimum-level :error)

;; Disable backup files (e.g., filename~)
(setq make-backup-files nil)

;; Disable auto-save files (e.g., #filename#)
(setq auto-save-default nil)

;; Disable lock file creation
(setq create-lockfiles nil)

;; Removes annoying prompts
(setq use-short-answers t)
#+end_src

** Backup storage location
#+begin_src elisp
(setq backup-directory-alist '(("." . "~/emacs/backups/")))
(setq auto-save-file-name-transforms '((".*" "~/emacs/auto-save-list/" t)))
#+end_src

